Белгипрозем_2017/src/Catalogs/Файлы/Файлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Файлы</name>
  <comment>Файлы в папках</comment>
  <attributes>
    <name>Автор</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <comment>Владелец файла</comment>
    <type>
      <types>CatalogRef.Корреспонденты</types>
      <types>BusinessProcessRef.РешениеВопросовВыполненияЗадач</types>
      <types>BusinessProcessRef.Исполнение</types>
      <types>DocumentRef.ПроизвольныйЭД</types>
      <types>DocumentRef.ВходящееСообщениеСВД</types>
      <types>CatalogRef.ПапкиФайлов</types>
      <types>DocumentRef.ИсходящееСообщениеСВД</types>
      <types>DocumentRef.ПакетЭД</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>BusinessProcessRef.Приглашение</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.СерверныеСообщенияСВД</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>BusinessProcessRef.ОбработкаИсходящегоДокумента</types>
      <types>BusinessProcessRef.ОбработкаВнутреннегоДокумента</types>
      <types>BusinessProcessRef.Поручение</types>
      <types>CatalogRef.Должности</types>
      <types>BusinessProcessRef.Утверждение</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.СообщенияОбсуждений</types>
      <types>BusinessProcessRef.КомплексныйПроцесс</types>
      <types>BusinessProcessRef.ОбработкаВходящегоДокумента</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>BusinessProcessRef.Рассмотрение</types>
      <types>CatalogRef.СообщенияЭДО</types>
      <types>CatalogRef.Мероприятия</types>
      <types>BusinessProcessRef.Согласование</types>
      <types>BusinessProcessRef.Ознакомление</types>
      <types>BusinessProcessRef.Регистрация</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <comment>Дата заема на редактирование</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата добавления файла в базу</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <comment>Файл зашифрован</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУдалятьСтарыеВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс иконки, соответствующей расширению файла, для показа в списке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <comment>Файл подписан ЭП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <comment>Полное наименование (длиной до 256 символов)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтратегияРаспознавания</name>
    <type>
      <types>EnumRef.СтратегииРаспознаванияТекста</types>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <comment>Пользователь, занявший файл для редактирования</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <comment>Текст, извлеченный из файла - для полнотекстового поиска</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсия</name>
    <comment>Активная версия</comment>
    <type>
      <types>CatalogRef.ВерсииФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияАвтор</name>
    <comment>Автор - пользователь, создавший версию</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияДатаМодификацииФайла</name>
    <comment>Дата модификации файла - в локальном времени</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияДатаСоздания</name>
    <comment>Дата создания версии</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияКод</name>
    <comment>Текущая версия код</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияНомерВерсии</name>
    <comment>Номер версии</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияПутьКФайлу</name>
    <comment>Дополнительный путь к файлу на диске (в случае если тип хранения файла - на диске)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияРазмер</name>
    <comment>Размер файла версии</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияРасширение</name>
    <comment>Расширение файла версии</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияТом</name>
    <comment>Ссылка на том (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонОснованиеДляСоздания</name>
    <comment>Шаблон файла, на основании которого был создан данный файл</comment>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯзыкРаспознавания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <comment>Хранить версии - если Ложь, у файла всегда одна версия - активная</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СубъектыПерсональныхДанных</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/Catalogs/ВидыБизнесСобытий/ВидыБизнесСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыБизнесСобытий</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВозобновлениеБизнесПроцесса</name>
      <description>Возобновление процесса</description>
    </items>
    <items>
      <name>ВыполнениеЗадачи</name>
      <description>Выполнение задачи</description>
    </items>
    <items>
      <name>ДобавлениеВКатегорию</name>
      <description>Добавление в категорию</description>
    </items>
    <items>
      <name>ЗавершениеБизнесПроцесса</name>
      <description>Завершение процесса</description>
    </items>
    <items>
      <name>ЗахватФайлаДляРедактирования</name>
      <description>Захват файла для редактирования</description>
    </items>
    <items>
      <name>ИзменениеВнутреннегоДокумента</name>
      <description>Изменение внутреннего документа</description>
    </items>
    <items>
      <name>ИзменениеВходящегоДокумента</name>
      <description>Изменение входящего документа</description>
    </items>
    <items>
      <name>ИзменениеИсходящегоДокумента</name>
      <description>Изменение исходящего документа</description>
    </items>
    <items>
      <name>ИзменениеМероприятия</name>
      <description>Изменение мероприятия</description>
    </items>
    <items>
      <name>ИзменениеПроекта</name>
      <description>Изменение проекта</description>
    </items>
    <items>
      <name>ИзменениеПроектнойЗадачи</name>
      <description>Изменение проектной задачи</description>
    </items>
    <items>
      <name>ИзменениеСоставаКомплекта</name>
      <description>Изменение состава комплекта</description>
    </items>
    <items>
      <name>ИзменениеФайла</name>
      <description>Изменение файла</description>
    </items>
    <items>
      <name>ОсвобождениеФайла</name>
      <description>Освобождение файла</description>
    </items>
    <items>
      <name>ОстановкаБизнесПроцесса</name>
      <description>Остановка процесса</description>
    </items>
    <items>
      <name>ОтменаВыполненияЗадачи</name>
      <description>Отмена выполнения задачи</description>
    </items>
    <items>
      <name>ПеренаправлениеЗадачи</name>
      <description>Перенаправление задачи</description>
    </items>
    <items>
      <name>ПеререгистрацияВнутреннегоДокумента</name>
      <description>Перерегистрация внутреннего документа</description>
    </items>
    <items>
      <name>ПеререгистрацияВходящегоДокумента</name>
      <description>Перерегистрация входящего документа</description>
    </items>
    <items>
      <name>ПеререгистрацияИсходящегоДокумента</name>
      <description>Перерегистрация исходящего документа</description>
    </items>
    <items>
      <name>ПрерываниеБизнесПроцесса</name>
      <description>Прерывание процесса</description>
    </items>
    <items>
      <name>РегистрацияВнутреннегоДокумента</name>
      <description>Регистрация внутреннего документа</description>
    </items>
    <items>
      <name>РегистрацияВходящегоДокумента</name>
      <description>Регистрация входящего документа</description>
    </items>
    <items>
      <name>РегистрацияИсходящегоДокумента</name>
      <description>Регистрация исходящего документа</description>
    </items>
    <items>
      <name>СозданиеВнутреннегоДокумента</name>
      <description>Создание внутреннего документа</description>
    </items>
    <items>
      <name>СозданиеВходящегоДокумента</name>
      <description>Создание входящего документа</description>
    </items>
    <items>
      <name>СозданиеЗадачи</name>
      <description>Создание задачи</description>
    </items>
    <items>
      <name>СозданиеИсходящегоДокумента</name>
      <description>Создание исходящего документа</description>
    </items>
    <items>
      <name>СозданиеКорреспондента</name>
      <description>Создание корреспондента</description>
    </items>
    <items>
      <name>СозданиеМероприятия</name>
      <description>Создание мероприятия</description>
    </items>
    <items>
      <name>СозданиеПроекта</name>
      <description>Создание проекта</description>
    </items>
    <items>
      <name>СозданиеПроектнойЗадачи</name>
      <description>Создание проектной задачи</description>
    </items>
    <items>
      <name>СозданиеСообщения</name>
      <description>Создание сообщения</description>
    </items>
    <items>
      <name>СозданиеФайла</name>
      <description>Создание файла</description>
    </items>
    <items>
      <name>СтартБизнесПроцесса</name>
      <description>Старт процесса</description>
    </items>
    <items>
      <name>УдалениеИзКатегории</name>
      <description>Удаление из категории</description>
    </items>
    <items>
      <name>Удалить_ВыполнениеЗадачи</name>
      <description>Удалить Выполнение задачи</description>
    </items>
    <items>
      <name>Удалить_ИзменениеСоставаКомплекта</name>
      <description>Удалить Изменение состава комплекта</description>
    </items>
    <items>
      <name>Удалить_ОтменаВыполненияЗадачи</name>
      <description>Удалить Отмена выполнения задачи</description>
    </items>
    <items>
      <name>Удалить_ПеренаправлениеЗадачи</name>
      <description>Удалить Перенаправление задачи</description>
    </items>
    <items>
      <name>УдалитьПодошелСрокЗадачи</name>
      <description>Удалить Подошел срок задачи</description>
    </items>
    <items>
      <name>УдалитьПросроченаЗадача</name>
      <description>Удалить Просрочена задача</description>
    </items>
    <items>
      <name>Удалить_СозданиеЗадачи</name>
      <description>Удалить Создание задачи</description>
    </items>
    <items>
      <name>Удалить_СозданиеФайла</name>
      <description>Удалить Создание файла</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

Белгипрозем_2017/src/Catalogs/Файлы/ObjectModule.bsl
// Обработка события ПередЗаписью
//
Процедура ПередЗаписью(Отказ)
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		ДополнительныеСвойства.Вставить("ЭтоНовый", Истина);
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("КонвертацияФайлов") Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("РазмещениеФайловВТомах") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВладелецФайла) Тогда
		
		Если ОбновлениеИнформационнойБазы.ВыполняетсяОбновлениеИнформационнойБазы() Тогда
			
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Файлы.Ошибка записи файла при обновлении ИБ'",
				     ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , Ссылка,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В файле ""%1"" не заполнен ВладелецФайла'"),
				Строка(Ссылка)));
				
		Иначе	
				
			ВызватьИсключение НСтр("ru = 'Нельзя записать файл, если не указан владелец файла.'");
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Если Не ЭтоНовый() Тогда
		
		ИзменилсяТолькоВладелец = Ложь;
		
		Если ВладелецИзменился() Тогда
			
			СтрокаОшибки = "";
			Если Не РаботаСФайламиПереопределяемый.ВозможноСменитьВладельцаФайла(ЭтотОбъект, СтрокаОшибки) Тогда
				ВызватьИсключение СтрокаОшибки;
			КонецЕсли;
			
			ИменаРеквизитов = Новый Массив;
			Для Каждого Реквизит Из Метаданные.Справочники["Файлы"].Реквизиты Цикл
				ИменаРеквизитов.Добавить(Реквизит.Имя);
			КонецЦикла;
			Для Каждого Реквизит Из Метаданные.Справочники["Файлы"].СтандартныеРеквизиты Цикл
				ИменаРеквизитов.Добавить(Реквизит.Имя);
			КонецЦикла;
			
			ИзменилсяТолькоВладелец = Истина;
			
			ПрежниеЗначенияРеквизитов = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Ссылка, ИменаРеквизитов);
			Для Каждого ПрежнееЗначениеРеквизита Из ПрежниеЗначенияРеквизитов Цикл
				ИмяРеквизита = ПрежнееЗначениеРеквизита.Ключ;
				ЗначениеРеквизита = ПрежнееЗначениеРеквизита.Значение;
				
				ЗначенияРеквизитовРазличаются = Ложь;
				Если ТипЗнч(ЗначениеРеквизита) = Тип("ХранилищеЗначения") Тогда
					ЗначенияРеквизитовРазличаются = (ЗначениеРеквизита.Получить() <> ЭтотОбъект[ИмяРеквизита].Получить());
				Иначе
					ЗначенияРеквизитовРазличаются = (ЗначениеРеквизита <> ЭтотОбъект[ИмяРеквизита]);
				КонецЕсли;
				
				Если ИмяРеквизита <> "ВладелецФайла" И ЗначенияРеквизитовРазличаются Тогда
					ИзменилсяТолькоВладелец = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		ЕстьПометкаУдаленияВИБ = ПометкаУдаленияВИБ();
		УстановленаПометкаУдаления = ПометкаУдаления И Не ЕстьПометкаУдаленияВИБ;
		ДополнительныеСвойства.Вставить("ПредыдущаяПометкаУдаления", ЕстьПометкаУдаленияВИБ);
		
		ИзмененаПометкаУдаления = Ложь;
		Если ДополнительныеСвойства.Свойство("ИзмененаПометкаУдаления") Тогда
			ИзмененаПометкаУдаления = ДополнительныеСвойства.ИзмененаПометкаУдаления;
		Иначе
			ИзмененаПометкаУдаления = (ПометкаУдаления <> ЕстьПометкаУдаленияВИБ);
			ДополнительныеСвойства.Вставить("ИзмененаПометкаУдаления", ИзмененаПометкаУдаления);
		КонецЕсли;
		
		ЗаписьПодписанногоОбъекта = Ложь;
		Если ДополнительныеСвойства.Свойство("ЗаписьПодписанногоОбъекта") Тогда
			ЗаписьПодписанногоОбъекта = ДополнительныеСвойства.ЗаписьПодписанногоОбъекта;
		КонецЕсли;	
		
		// разрешаем ставить пометку удаления на подписанный файл
		Если Не ПривилегированныйРежим()
			И Не ЗаписьПодписанногоОбъекта
			И Не ИзмененаПометкаУдаления 
			И Не ИзменилсяТолькоВладелец Тогда
			
			СтруктураРеквизитов = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Ссылка, "ПодписанЭП, Зашифрован");
			СсылкаПодписан = СтруктураРеквизитов.ПодписанЭП;
			СсылкаЗашифрован = СтруктураРеквизитов.Зашифрован;
			
			Если ПодписанЭП И СсылкаПодписан Тогда
				ВызватьИсключение НСтр("ru = 'Подписанный файл нельзя редактировать.'");
			КонецЕсли;	
			
			Если Зашифрован И СсылкаЗашифрован И ПодписанЭП И НЕ СсылкаПодписан Тогда
				ВызватьИсключение НСтр("ru = 'Зашифрованный файл нельзя подписывать.'");
			КонецЕсли;	
			
		КонецЕсли;	
		
		Если Не ПометкаУдаления И Не ТекущаяВерсия.Пустая() Тогда
			
			РеквизитыТекущейВерсии = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ТекущаяВерсия, 
				"ПолноеНаименование");
			
			// Проверим равенство имени файла и его текущей версии
			// Если имена отличаются - имя у версии должно стать как у карточки с файлом
			Если РеквизитыТекущейВерсии.ПолноеНаименование <> ПолноеНаименование Тогда
				Объект = ТекущаяВерсия.ПолучитьОбъект();
				Если Объект <> Неопределено И Объект.Ссылка <> Неопределено Тогда
					ЗаблокироватьДанныеДляРедактирования(Объект.Ссылка);
					УстановитьПривилегированныйРежим(Истина);
					Объект.ПолноеНаименование = ПолноеНаименование;
					Объект.ДополнительныеСвойства.Вставить("ПереименованиеФайла", Истина); // чтобы не сработала подписка СкопироватьРеквизитыВерсииФайловВФайл
					Объект.Записать();
					УстановитьПривилегированныйРежим(Ложь);
				КонецЕсли;	
			КонецЕсли;
			
		КонецЕсли;
		
		Если ИзмененаПометкаУдаления Тогда
			
			// Проверка права "Пометка на удаление".
			Если Не РаботаСФайламиПереопределяемый.ПометкаУдаленияРазрешена(Ссылка) Тогда
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'У вас нет прав для установки пометки удаления файла ""%1"".'"),
					Строка(Ссылка));
			КонецЕсли;
			
			// Попытка установить пометку удаления
			Если УстановленаПометкаУдаления И Не Редактирует.Пустая() Тогда
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				                    НСтр("ru = 'Нельзя удалить файл ""%1"", т.к. он занят для редактирования пользователем ""%2"".'"),
				                    ПолноеНаименование,
				                    Строка(Редактирует) );
			КонецЕсли;
			
			СтрокаОшибки = "";
			Если Не РаботаСФайламиПереопределяемый.ВозможноУдалитьФайл(ЭтотОбъект, СтрокаОшибки) Тогда
				ВызватьИсключение СтрокаОшибки;
			КонецЕсли;
			
		КонецЕсли;
		
		НаименованиеВИБ = НаименованиеВИБ();
		Если ПолноеНаименование <> НаименованиеВИБ Тогда 
			Если Не Редактирует.Пустая() Тогда
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				                    НСтр("ru = 'Нельзя переименовать файл ""%1"", т.к. он занят для редактирования пользователем ""%2"".'"),
				                    НаименованиеВИБ,
				                    Строка(Редактирует) );
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Ссылка.ВладелецФайла <> ВладелецФайла Тогда
		
		ВладелецФайлаЭтоДокумент = ДелопроизводствоКлиентСервер.ЭтоДокумент(Ссылка.ВладелецФайла);
		Если ВладелецФайлаЭтоДокумент Тогда
			ВладелецФайлаПодписанЭП = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Ссылка.ВладелецФайла, "ПодписанЭП");
			Если ВладелецФайлаПодписанЭП Тогда
				ВызватьИсключение НСтр("ru = 'Нельзя сменить владельца файла подписанного документа.'");
			КонецЕсли;
		КонецЕсли;
		
		НовыйВладелецФайлаЭтоДокумент = ДелопроизводствоКлиентСервер.ЭтоДокумент(ВладелецФайла);
		Если НовыйВладелецФайлаЭтоДокумент Тогда
			НовыйВладелецФайлаПодписанЭП = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ВладелецФайла, "ПодписанЭП");
			Если НовыйВладелецФайлаПодписанЭП Тогда
				ВызватьИсключение НСтр("ru = 'Нельзя установить владельцем файла подписанный документ.'");
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетДоступаКПерсональнымДанным") Тогда		
		
		Если ЭтоНовый() Тогда
			ПерсональныеДанные.ЗаполнитьСписокСубъектовПерсональныхДанныхФайла(ЭтотОбъект);
			Если СубъектыПерсональныхДанных.Количество() <> 0 Тогда
				ДополнительныеСвойства.Вставить("ОбновитьПерсональныеДанныеВерсий", Истина);
			КонецЕсли;	
		ИначеЕсли ВладелецИзменился() Тогда
			ПерсональныеДанные.ЗаполнитьСписокСубъектовПерсональныхДанныхФайла(ЭтотОбъект);
			ДополнительныеСвойства.Вставить("ОбновитьПерсональныеДанныеВерсий", Истина);
		Иначе
			Если ПерсональныеДанные.ИзменилсяСписокПерсональныхДанных(ЭтотОбъект) Тогда
				ДополнительныеСвойства.Вставить("ОбновитьПерсональныеДанныеВерсий", Истина);
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЕсли;	
	
	Наименование = СокрЛП(ПолноеНаименование);
	
КонецПроцедуры

Функция ВладелецИзменился()
	
	Если ОбщегоНазначения.ПолучитьЗначениеРеквизита(Ссылка, "ВладелецФайла") = ВладелецФайла Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;	
	
КонецФункции	

// Возвращает текущее значение пометки удаления в информационной базе
Функция ПометкаУдаленияВИБ()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.ПометкаУдаления
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Результат = Запрос.Выполнить();

	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.ПометкаУдаления;
	КонецЕсли;	
	
	Возврат Неопределено;
КонецФункции

// Возвращает текущее значение наименования в информационной базе
Функция НаименованиеВИБ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Файлы.ПолноеНаименование
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|ГДЕ
	|	Файлы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.ПолноеНаименование;
	КонецЕсли;
	
	Возврат Неопределено;	
	
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
		ХранитьВерсии = Истина;
		ИндексКартинки = ФайловыеФункцииКлиентСервер.ПолучитьИндексПиктограммыФайла(Неопределено);
		
		Автор = ПользователиКлиентСервер.ТекущийПользователь();
		ДатаСоздания = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка
		И ЗначениеЗаполнено(ОбменДанными.Отправитель)
		И ОбменДаннымиПовтИсп.ЭтоУзелРаспределеннойИнформационнойБазы(ОбменДанными.Отправитель) Тогда
		Возврат;
	КонецЕсли;
	
	// Возможно, выполнена явная регистрация событий при загрузке объекта.
	Если Не ДополнительныеСвойства.Свойство("НеРегистрироватьБизнесСобытия") Тогда
		Если ДополнительныеСвойства.Свойство("ЭтоНовый") И ДополнительныеСвойства.ЭтоНовый Тогда
			БизнесСобытияВызовСервера.ЗарегистрироватьСобытие(Ссылка, Справочники.ВидыБизнесСобытий.СозданиеФайла);	
		КонецЕсли;
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПредыдущаяПометкаУдаления = Ложь;
	Если ДополнительныеСвойства.Свойство("ПредыдущаяПометкаУдаления") Тогда
		ПредыдущаяПометкаУдаления = ДополнительныеСвойства.ПредыдущаяПометкаУдаления;
	КонецЕсли;
	
	Если ПометкаУдаления <> ПредыдущаяПометкаУдаления Тогда
		ПротоколированиеРаботыПользователей.ЗаписатьПометкуУдаления(Ссылка, ПометкаУдаления);
	КонецЕсли;	
	
	Если ДополнительныеСвойства.Свойство("ОбновитьПерсональныеДанныеВерсий")
		И ДополнительныеСвойства.ОбновитьПерсональныеДанныеВерсий Тогда
		
		ПерсональныеДанные.ЗаполнитьПерсональныеДанныеВерсийФайла(Ссылка);
		
	КонецЕсли;	
		
КонецПроцедуры
